//═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                                                                     //
//                                                             ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                                               //
//                                                                                                                                                     //
//                                                                    Ｖ：１．０．１                                                                     //
//                                                                                                                                                     //
//                                     ░█████╗░██╗░░░░░██╗███████╗███╗░░██╗  ░█████╗░██╗░░░░░███████╗░█████╗░                                          //
//                                     ██╔══██╗██║░░░░░██║██╔════╝████╗░██║  ██╔══██╗██║░░░░░██╔════╝██╔══██╗                                          //
//                                     ███████║██║░░░░░██║█████╗░░██╔██╗██║  ███████║██║░░░░░█████╗░░███████║                                          //
//                                     ██╔══██║██║░░░░░██║██╔══╝░░██║╚████║  ██╔══██║██║░░░░░██╔══╝░░██╔══██║                                          //
//                                     ██║░░██║███████╗██║███████╗██║░╚███║  ██║░░██║███████╗██║░░░░░██║░░██║                                          //
//                                     ╚═╝░░╚═╝╚══════╝╚═╝╚══════╝╚═╝░░╚══╝  ╚═╝░░╚═╝╚══════╝╚═╝░░░░░╚═╝░░╚═╝                                          //
//                                                                                                                                                     //
//                                                                                                                                                     //
//═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════//

// Obfuscated By AlienAlfa
// Unecrypted file Willbe relesed Soon
// Full file will be relised After all BUGS Has been Fixed

// CURRENTLY RUNNING ON BETA VERSION!!
/**
   * MIT License
* 
   * Copyright (c) 2021 Alien-Alfa.
* 
   * Permission is hereby granted, free of charge, to any person obtaining a copy
   * of this software and associated documentation files (the "Software"), to deal
   * in the Software without restriction, including without limitation the rights
   * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   * copies of the Software, and to permit persons to whom the Software is
   * furnished to do so, subject to the following conditions:
* 
   * The above copyright notice and this permission notice shall be included in all
   * copies or substantial portions of the Software.
* 
   * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
   * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
   * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
   * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
   * SOFTWARE.
*/




const fs = require('fs')
const chalk = require('chalk')


var ownernum = ['0','6289677134384']
//-------------


// Website Api
global.APIs = {
	zenz: 'https://zenzapis.xyz',
	devil: 'https://api-toxic-devil.herokuapp.com/api',
} 
 
global.APIKeys = {
	'https://zenzapis.xyz': '' }
    


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //---------------------------------------------------------------------

   global.worktype = 'private'

   //---------------------------------------------------------------------
   
   
   //---------------------------------------------------------------------

   global.sudo = ['6289677134384']
   //-------------
   global.owner = ['6289677134384']

   //---------------------------------------------------------------------
   
   global.packname = 'Rexa' 
   //-------------
   global.author = 'Rexa'

   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


   //--------------------- MENU URL BUTTON 1 ------------------------

   global.linkbuttid1 = 'Instagram' 
   //-------------
   global.butturl1 = 'https://www.instagram.com/syhndr_/'
   
   //---------------------------------------------------------------------



   //--------------------- MENU URL BUTTON 2 ------------------------

   global.linkbuttid2 = 'ʏᴏᴜᴛᴜʙᴇ'
   //-------------
   global.butturl2 = 'https://youtube.com/c/rexashh'
   
   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|REXA ROBOT|═══════════════════════════════════════════⬡|//	


   //--------------------- ADPLAY OPTIONS ------------------------

   global.linktext = 'Owner'
   //-------------
   global.linkurl = 'https://t.me/JustRex'
   
   //---------------------------------------------------------------------


//|⬡════════════════════════════════════════════|REXA ROBOT|═══════════════════════════════════════════⬡|//	


   //--------------------- MAIN IMAGE  ------------------------

   global.profileimage = 'https://github.com/Rexashh/photos/blob/bb84be726393e1f7783549312ab70e8cfa23df6f/photos/Picsart_23-01-29_09-14-27-098.jpg?raw=true'
      
   //---------------------------------------------------------------------

//|⬡════════════════════════════════════════════|REXA ROBOT|═══════════════════════════════════════════⬡|//	

   //--------------------- URL IMAGE  ------------------------

   global.mainimgurl = 'https://github.com/Alien-alfa/Alien-alfa/blob/beta/Alfa.jpg?raw=true'
      
   //---------------------------------------------------------------------



//|⬡════════════════════════════════════════════|REXA ROBOT|═══════════════════════════════════════════⬡|//	


   //--------------------- MAIN MENU BUTTON ------------------------
   
   global.mlinktxt1 = 'OWNER'
   //-------------
   global.mlinkurl1 = 'https://t.me/JustRex'
   //------------- 
   
 //------ URL BUTTON 2 -----
   global.mlinktxt2 = null
   //-------------
   global.mlinkurl2 = null
   //-------------
 
 //------ REP BUTTON 1 -----
   global.mbuttxt1 = 'ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅꜱ'
   //-------------
   global.mbutid1 = 'command'
   //-------------
   
 //------ REP BUTTON 2 -----
   global.mbuttxt2 = null 
   //-------------
   global.mbutid2 = null
   //-------------
   
 //------ REP BUTTON 3 -----
   global.mbuttxt3 = null
   //-------------
   global.mbutid3 = null
   //-------------
   
   //---------------------------------------------------------
   
//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


//============ MAIN ============//

//-------------
global.premium = [`${ownernum}`]
//-------------
global.sessionName = 'session.alfa'
//-------------
global.prefa = ['','!','.','🐦','🐤','🗿']
//-------------
global.sp = '𒆜'
//-------------
global.devname = 'REXA'
//-------------
global.devNum = ['6289677134384']
//-------------
global.greetings = 'Hey  👋🏻'
//-------------
global.listicon = '✩' 
//-------------
global.wm = 'REXA' 
//-------------
global.botname = 'REXA ROBOT'
//-------------
global.icon = '✩' 
//-------------
global.mail = 'tirexijo@gmail.com'
//-------------
global.youtube = 'https://youtube.com/c/alienalfa'
//-------------
global.github = 'https://github.com/Rexashh/' 
//-------------
global.insta = 'https://www.instagram.com/syhndr_/' 
//-------------
global.linkname = 'REXA'
//-------------
global.mainfooter = 'REXA' 
//-------------
global.herokuapi = '' 
//-------------
global.herokuapp = '' 


//|⬡════════════════════════════════════════════|❝ Ⓒ𝙰𝙻𝙸𝙴𝙽 𝙰𝙻𝙵𝙰 𝙱𝙾𝚃 𝙱𝚈 𝚃𝙾𝚇𝙸𝙲 𝙰𝙻𝙸𝙴𝙽™ ❞|═══════════════════════════════════════════⬡|//	


//============ Modz ============//

//-------------
global.welcomeactive =  true
//-------------
global.alivemess = false
//-------------
global.aliveimage = false
//-------------
global.speedmode =  'active'
//-------------
global.ownermess = 'ʜᴇʏ ᴛʜɪꜱ ɪꜱ ᴍʏ ᴏᴡɴᴇʀ, ᴘʟᴇᴀꜱᴇ ᴛᴀʟᴋ ɪɴ ᴇɴɢʟɪꜱʜ'
//-------------
global.autoread = false 
//-------------
global.anticall = false 
//-------------





global.thumb = fs.readFileSync('./lib/lowdb/adapters/alfa.jpg')

global.mess = {
    success: 'ᴅᴏɴᴇ',
    errr: 'err',
    admin: 'ᴏɴʟʏ ᴀᴅᴍɪɴ',
    botAdmin: 'ɪ ᴡɪʟʟ ᴅᴏ ɪᴛ, ᴍᴀᴋᴇ ᴍᴇ ᴀɴ ᴀᴅᴍɪɴ!',
    owner: 'ᴏᴡɴᴇʀ ᴄᴏᴍᴍᴀɴᴅ!',
    group: 'ᴛʜɪꜱ ɪꜱ ɴᴏᴛ ᴀ ɢʀᴏᴜᴘ ᴄʜᴀᴛ!',
    private: 'ᴛʜɪꜱ ɪꜱ ᴀ ɢʀᴏᴜᴘ, ᴜꜱᴇ ɪᴛ ɪɴ ᴘʀɪᴠᴀᴛᴇ ᴄʜᴀᴛ!',
    bot: '',
    wait: 'ᴘʟᴇᴀꜱᴇ ᴡᴀɪᴛ...',
    endLimit: 'ʏᴏᴜʀ ᴅᴀɪʟʏ ʟɪᴍɪᴛ ʜᴀꜱ ᴇxᴘɪʀᴇᴅ, ᴛʜᴇ ʟɪᴍɪᴛ ᴡɪʟʟ ʙᴇ ʀᴇꜱᴇᴛ ᴇᴠᴇʀʏ 12 ʜᴏᴜʀꜱ',
    notext: 'ᴇɴᴛᴇʀ ꜱᴇᴀʀᴄʜ ʟɪɴᴋꜱ!',
}
global.limitawal = {
    premium: "Infinity",
    free: 100
}


let file = require.resolve(__filename)
fs.watchFile(file, () => {
	fs.unwatchFile(file)
	console.log(chalk.redBright(`Update'${__filename}'`))
	delete require.cache[file]
	require(file)
})
